app/views/requirements/index.html.erb

    <h3>
      <%= link_to "Requirements", root_url %> (<%= @requirements.size %> éléments)
---
SELECT COUNT(*) FROM `requirements`
SELECT `requirements`.* FROM `requirements`