app/views/requirements/show.html.erb

SELECT `transactional_functions`.* FROM `transactional_functions` WHERE `transactional_functions`.`requirement_id` = 1
---
      <tbody>
        <% @requirement.transactional_functions.each do |tf| %>