app/controllers/data_functions_controller.rb

SELECT `data_functions`.* FROM `data_functions`
---
  def index
    @data_functions = DataFunction.all