app/controllers/requirements_controller.rb

  def index
    #@requirements = Requirement.all
    @requirements  = Requirement.paginate(page: params[:page], per_page: 20)
---
SELECT COUNT(*) FROM `requirements`
SELECT `requirements`.* FROM `requirements`

  def create
    @requirement = Requirement.new(requirement_params)

    respond_to do |format|
      if @requirement.save
---
INSERT INTO `requirements` (`content`, `storypoint`, `created_at`, `updated_at`) VALUES ('require 1', 1.1, '2020-02-13 14:43:23', '2020-02-13 14:43:23')

  def update
    respond_to do |format|
      if @requirement.update(requirement_params)
---
UPDATE `requirements` SET `storypoint` = 1.2, `updated_at` = '2020-02-13 14:43:33' WHERE `requirements`.`id` = 1

  def destroy
    @requirement.destroy
---
DELETE FROM `requirements` WHERE `requirements`.`id` = 2

  def import_requirements_file

    Requirement.delete_all
    TransactionalFunction.delete_all
    DataFunction.delete_all

    tab_error = []

    if params[:file].nil?
      flash[:error] = "Erreur : pas de fichier"
    elsif !params[:file].nil? && (File.extname(params[:file].original_filename) == ".xlsx" || File.extname(params[:file].original_filename) == ".Xlsx")

      workbook = RubyXL::Parser.parse(params[:file].path)

      worksheet0 = workbook[0]
      worksheet2 = workbook[2]

      worksheet0.each_with_index do |row, index|
        if index > 0
          requirement = Requirement.where(content: row[5].nil? ? "" : row[5].value).first

          if requirement.nil?

            requirement = Requirement.create(content: row[5].nil? ? nil : row[5].value,
                                             storypoint: row[5].nil? ? nil : row[5].value)

          end

          TransactionalFunction.create(requirement_id: requirement.id,
                                       content: row[5].nil? ? nil : row[5].value,
                                       tf_type: row[6].nil? ? "" : row[6].value,
                                       traceability: row[12].nil? ? "" : row[12].value)
---
DELETE FROM `requirements`
DELETE FROM `data_functions`
DELETE FROM `transactional_functions`
SELECT  `requirements`.* FROM `requirements` WHERE `requirements`.`content` IS NULL  ORDER BY `requirements`.`id` ASC LIMIT 1
INSERT INTO `requirements` (`content`, `storypoint`, `created_at`, `updated_at`) VALUES ('0', 1.1, '2020-02-14 15:31:52', '2020-02-14 15:31:52')
SELECT  `requirements`.* FROM `requirements` WHERE `requirements`.`storypoint` = NULL  ORDER BY `requirements`.`id` ASC LIMIT 1
INSERT INTO `data_functions` (`content`, `data_type`, `ret`, `data_attribute`, `created_at`, `updated_at`) VALUES ('DATA', 'TYPE', 0, 'ATTRIBUTE', '2020-03-02 09:23:50', '2020-03-02 09:23:50')
INSERT INTO `transactional_functions` (`requirement_id`, `content`, `tf_type`, `traceability`, `created_at`, `updated_at`) VALUES (3, 'Description', 'Type', 'Tracabilité', '2020-03-02 09:08:36', '2020-03-02 09:08:36')

    def set_requirement
      @requirement = Requirement.find(params[:id])
---
SELECT  `requirements`.* FROM `requirements` WHERE `requirements`.`id` = 2 LIMIT 1